---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedCurveParamater
source: html/5e65140e-9ba4-e393-f861-092392157f38.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementNormalizedCurveParamater Property

"Normalized Curve Parameter"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementNormalizedCurveParamater { get; }
```